Александр Пушкин 120
Адольф Гитлер 99
Альберт Эйнштейн 160
Исаак Ньютон 160
Жан-Жак Руссо 145
Чарльз Дарвин 165
Фрэнсис Бэкон 170
Михаил Ломоносов 160
Аристотель 155
Александр Флеминг 130
Луи Пастер 145
Галилео Галилей 160
Уильям Шекспир 155
Карл Маркс 155
Наполеон Бонапарт 145
Лев Толстой 160
Фридрих Ницше 150
Стивен Хокинг 160
Герман Гессе 140
Рене Декарт 155
Михаил Кутузов 145
Леонардо даВинчи 180
Никола Тесла 160
Жанн д'Арк 120
Вольтер 155
Василий Жуковский 120
Леонард Бернштейн 125
Михаил Герцен 125
