otvet = input('Хотите добавить цитату? ')
while otvet != 'нет':
    quote = input('Введите цитату: ')
    author = input('Введите автора: ')
    file = open('quote.txt','a',encoding='utf-8')
    file.write('\n' + quote + '\n' + author + '\n')
    otvet = input('Хотите добавить цитату? ')

print('Ваш цитатник:')
file = open('quote.txt','r',encoding='utf-8')
print( file.read() )


Наруто 167
Гарри-Поттер 150
Бен-Тен 140
Супермен 185
Спайдермен 175
Бэтмен 182
Халк 240
Лея-Органа 160
Дарт-Вейдер 180
Лиона 155
Чудо-Женщина 175
Железный-Человек 180
Гринч 170
Пикачу 40
Гомера 175
Марио 155
Соник 90
Кот-Генерал 160
Мистер-Робот 180
Дедпул 185
