answer = input('Хотите добавить цитату: ') 
while answer != 'нет':
    quote = input('Введите цитату: ')
    author = input('Введите автора: ')
    file = open('quotes.txt','a',encoding='utf-8')
    file.write(author + ' : ' + quote + '\n')
    answer = input('Хотите добавить цитату: ') 


Наруто Узумаки 120 166
Леви Аккерман 160 160
Гарри Поттер 125 170
Тони Старк 180 174
Кларк Кент 180 191
Эдвард Элрик 150 165
Дарт Вейдер 140 202
Люпен Третий 135 178
Саске Учиха 130 168
Джон Сноу 140 180
Питер Паркер 145 178
Микки Маус 100 70
